# Напишите функцию, которая находит
# наибольший общий делитель двух натуральных чисел
# На входе два числа, на выходе их НОД.
def NOD(a, b):
    while b:
        a, b = b, a % b
    return a
a = int(input())
b = int(input())
print(NOD(a,b))



