# Напишите процедуру, которая выводит на экран
# запись переданного ей числа в римской системе счисления.
# Числа находятся в диапазоне [1, 3999]
# I - 1, V - 5, X - 10, L - 50, C  - 100, D - 500, M - 1000
# Пример:
# 2013
# MMXIII
def roman(num):
    # Список кортежей с римскими числами и их значениями
    val = [
        (1000, 'M'),
        (900, 'CM'),
        (500, 'D'),
        (400, 'CD'),
        (100, 'C'),
        (90, 'XC'),
        (50, 'L'),
        (40, 'XL'),
        (10, 'X'),
        (9, 'IX'),
        (5, 'V'),
        (1, 'I')
    ]

    a = ''

    # Проходим по значениям и формируем римскую запись
    for (integer, roman) in val:
        while num >= integer:
            a += roman
            num -= integer

    return a


# Пример использования
number = int(input())
rimskiy= roman(number)
print(rimskiy)